case/Rheometer_Git/RheometerKonvergenzanalyse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            navierSlip;
        wallVelocity           nonuniform List<vector> 
968
(
(2.32798e-20 0.0255337 -0)
(-1.74694e-21 0.0263384 0)
(0 0.0271431 0)
(0 0.0279478 0)
(1.74921e-21 0.0287525 -0)
(-2.01104e-20 0.0295572 0)
(0 0.0303619 0)
(0 0.0311666 0)
...
)
;
        slipLength      uniform 5.38456e-07;
        value    uniform (0 0 0);
    }
    inlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            navierSlip;
        value           uniform (0 0 0);
        slipLength      uniform 5.38456e-07;
        wallVelocity    uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    left
    {
        type            wedge;
    }
    right
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
