case/Rheometer_Git/RheometerKonvergenzanalyse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100000;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;
libs ("navierSlipBc.so");
//libs ("/home/mb97dydy/OpenFOAM/mb97dydy-v2206/platforms/linux64GccDPInt32Opt/lib/libnavierSlipBc.so");

functions
{

    forces
    {
        type                  forces;
        libs                  ("libforces.so");
        patches               ("bottom");
        p                     p;
        u                     U;
        CofR                  (0 0 0);
        rho                   rhoInf;
        rhoInf                662.3;
        writeControl          timeStep;
        writeInterval         1;

    }
}

// ************************************************************************* //
